export const products = [
  {
    id: "1",
    text: "Ноутбуки",
    imageSrc: "/img/notebook.jpg",
    items: [
      {
        id: "1",
        imageSrc: "/img/lenova.jpg",
        text: "Lenovo",
        price: 55000,
        description:
          "Ноутбук Lenovo Ideapad 1 - мощный и надежный помощник в работе и развлечениях. Оснащен процессором AMD Athlon Silver-7120U с частотой 2.4 ГГц и 2 ядрами, что обеспечивает высокую производительность и быстродействие.",
      },
      {
        id: "2",
        imageSrc: "/img/hp.jpg",
        text: "HP",
        price: 35000,
        description:
          "Ноутбук HP Laptop 15 - это современное и функциональное устройство, которое станет незаменимым помощником в работе и развлечениях.Ноутбук оснащен процессором Intel Celeron N4120 с частотой 1.1 ГГц, что обеспечивает быструю и стабильную работу. В ноутбуке установлено 8 ГБ оперативной памяти DDR4, что позволяет одновременно запускать несколько приложений и работать с большими объемами данных.",
      },
      {
        id: "3",
        imageSrc: "/img/asus.jpg",
        text: "ASUS",
        price: 75000,
        description:
          "Ноутбук ASUS VivoBook 17X M3704YA-AU052 – оптимальное решение для выполнения большого объема офисных и домашних задач. Энергоемкий литий-ионный аккумулятор позволяет использовать его на протяжении долгого времени без подзарядки.ASUS VivoBook 17X оснащен 8-ядерным процессором AMD Ryzen 7 7730U частотой 2 ГГц, что позволяет выполнять самые сложные задачи. Большой объем оперативной памяти дает возможность запускать одновременно несколько приложений и быстро переключаться между ними.",
      },
    ],
  },
  {
    id: "2",
    text: "Роутеры",
    imageSrc: "/img/router.jpg",
    items: [
      {
        id: "4",
        imageSrc: "/img/microtic.jpg",
        text: "Microtic",
        price: 15000,
        description:
          "Общие характеристики Тип устройства маршрутизатор Возможность установки в стойку есть Коммутатор/концентратор Общее количество портов 10 Базовая скорость передачи данных 1 Гбит/с Количество uplink/стек/SFP-портов и модулей 1 Максимальная скорость uplink/SFP-портов 1 Гбит/с Маршрутизатор DHCP-сервер есть Межсетевой экран (Firewall) есть Память Объем оперативной памяти 1024 МБ Объем флэш-памяти 128 МБ Поддержка стандартов Сетевые стандарты автоопределение MDI/MDIX Мониторинг и конфигурирование Консольный порт есть Web-интерфейс есть Дополнительные характеристики USB-порт есть Ширина 443 мм Высота 44 мм Глубина 92 мм Вес 0.95 кг Дополнительная информация cенсорный touchscreen LCD экран",
      },
      {
        id: "5",
        imageSrc: "/img/tp.jpg",
        text: "Tp-Link",
        price: 10000,
        description:
          "802.11ac Wave 2 Wi-Fi — до 1300 Мбит/с на диапазоне 5 ГГц и до 600 Мбит/с на 2,4 ГГц. Технология MIMO 3×3 — отправка и получение данных в три потока для идеальной работы с устройствами 3×3. Улучшенное покрытие Wi-Fi – благодаря технологии Beamforming. MU-MIMO — оптимальная производительность устройств за счёт оптимизации подключений. Повышенная безопасность – благодаря родительскому контролю, гостевой сети и управлению доступом. Умное подключение — функция Smart Connect переводит клиентов на менее загруженный канал, а Airtime Fairness оптимизирует использование эфирного времени. WPA3 — поддержка последнего стандарта шифрования, улучшающего безопасность и обеспечивающего защиту от брутфорс атак. Поддержка OneMesh — используйте усилители OneMesh, чтобы создать покрытие во всём доме и не терять сигнал при перемещении. Беспроводное вещание Стандарты Wi-Fi 5 IEEE 802.11ac/n/a 5 ГГц IEEE 802.11n/b/g 2,4 ГГц. Скорость Wi-FiAC1900 5 ГГц: 1300 Мбит/с (802.11ac) 2,4 ГГц: 600 Мбит/с (802.11n)Покрытие Wi-Fi Для трёхкомнатных квартир4 фиксированные высокопроизводительные антенны Из нескольких антенн формируется мощный сигнал, увеличивающий радиус действия Beamforming Концентрирует беспроводной сигнал в направлении клиентов для расширения радиуса действия Wi-FiПропускная способность Wi-Fi Средняя Два диапазона Присвойте каждому устройству свой диапазон для оптимальной производительности 3×3 MU-MIMO Одновременная коммуникация с множеством клиентов MU-MIMO Airtime Fairness Улучшение эффективности сети за счёт одинакового времени передачи для всех клиентов Smart Connect Автоматическое назначение каждого устройства на лучший из доступных диапазонов Wi-FiРежимы работы.",
      },
      {
        id: "6",
        imageSrc: "/img/zyxel.png",
        text: "Zyxel",
        price: 21000,
        description:
          "Cетевое оборудование Маршрутизаторы Беспроводный маршрутизатор Zyxel NBG6604 с скоростным Wi-Fi стандарта 802.11ac. Сеть WiFi работает быстрее и у нее мощнее сигнал. Четыре сетевых порта Ethernet для подключения проводных устройств.Преимущества: Новый дизайн, более эффективное охлаждение. Опция установки на стене для большей гибкости. Cветодиодный индикатор WiFi WPS. Моб. приложение ONE Connect. Доступно несколько режимов работы: маршрутизатор и точка доступа. Возможность крепления на стене.Комплектация: Полную комплектацию товара уточняйте у производителяОсобенности: Нет поддержки Dual Mode для работы IPTV (одновременно с PPPoE). Нет поддержки L2TP и PPTP.",
      },
    ],
  },
  {
    id: "3",
    text: "Модемы",
    imageSrc: "/img/modem.jpg",
    items: [
      {
        id: "7",
        imageSrc: "/img/huawei.jpg",
        text: "Huawei",
        price: 4500,
        description:
          "Подключить компьютер или ноутбук к интернету поможет модем Huawei E3372-325 3G/4G. Его компактный и легкий корпус поместится даже в кармане, поэтому его комфортно везде брать с собой. Подключение к рабочему устройству происходит через интерфейс USB. Таким образом, процесс установки не вызовет сложностей у пользователей любого уровня.",
      },
      {
        id: "8",
        imageSrc: "/img/zte.jpg",
        text: "ZTE",
        price: 5600,
        description:
          "Работает со всеми операторами мобильной связи (Мегафон, МТС, Билайн, Теле 2, Yota) с любыми тарифами. В модеме есть слот для карт памяти MicroSD 32 Гб, позволяющих превратить его в портативный накопитель информации. Устройство выполняет еще и функции Wi-Fi роутера. Может работать как точка доступа для 10 устройств через Wi-Fi на частоте 2.4 ГГц. Радиус раздачи Wi-Fi до 10 метров. Модем ZTE MF79RU передает данные в стандарте 3G одновременно по двум каналам связи, благодаря чему достигается высокая скорость - до 43.2 Мбит/с (технология DC-HSPA+). В стандарте 4G устройство достигает максимальной скорости передачи данных до 150 Мбит/с на прием данных. Два разъема TS9 для подключения внешней антенны - FDD B1/3/7/20 - TDD B38 - UMTS B1/B8 Комплектация: 1. Модем MF79U - 1 шт. 2. Антенна TS9 - 2 шт.",
      },
      {
        id: "9",
        imageSrc: "/img/yota.jpg",
        text: "Yota",
        price: 4900,
        description:
          "Работает в частотах 4G 4G+  LTE со скоростью до 150Мбсек! Описание модема : - работает со всеми операторами МТС Теле2 Мегафон Билайн Ростелеком WiFire и др. - интерфейс подключения: USB - удобный Web интерфейс - стандарты: 4G 4G+LTE - размеры: 28x12x88 мм - вес 55 г -скорость приёма данных до 150 Мбит/с скорость передачи данных - до 50 Мбит/с.",
      },
    ],
  },
  {
    id: "4",
    text: "Смартфоны",
    imageSrc: "/img/smart.jpg",
    items: [
      {
        id: "10",
        imageSrc: "/img/xiaomi.jpeg",
        text: "Xiaomi",
        price: 30000,
        description:
          "6.67 ″ процессор Mediatek G99 Ultra , камера 200MP, 8 MP + 2 MP + 16 MP, 4G, Wi-Fi, Bluetooth 5.2, RAM 12GB, 512GB встроенной памяти, USB Type-C, microSD, поддержка 2-х SIM-карт, Android 14, 1161.1 x 75 x 8 мм, 188 г.",
      },
      {
        id: "11",
        imageSrc: "/img/honor.jpg",
        text: "Honor",
        price: 35000,
        description:
          "Указана актуальная на момент презентации устройства версия операционной системы: Android 13 Материал корпуса: Пластик Количество SIM-карт: 2 Режим работы нескольких SIM-карт: попеременный Цвет: Чёрный Вес (грамм): 183 Размеры: 16,19 x 7,41 x 0,78 см Объем встроенной памяти: 256 ГБ Стандарт сотовой связи: GSM / CDMA / HSPA / CDMA2000 / LTE / 5G Поддержка диапазонов 5G: 1, 5, 8, 28, 41, 77, 78 SA/NSA Поддержка диапазонов LTE: 1, 3, 4, 5, 8, 19, 28, 34, 38, 39, 40, 41 Интерфейсы: Bluetooth, Wi-Fi, NFC Поддержка Wi-Fi: Wi-Fi 802.11 a/b/g/n/ac/6 Возможности Wi-Fi: Wi-Fi Direct Поддержка Bluetooth: Bluetooth 5.2 Возможности Bluetooth: A2DP, LE, aptX HD ",
      },
      {
        id: "12",
        imageSrc: "/img/samsung.jpg",
        text: "Samsung",
        price: 39000,
        description:
          "SAMSUNG Galaxy A55 — смартфон с большим четким дисплеем, качественной системой камер и фирменным дизайном. Устройство получило емкую батарею и прочный корпус с защитой от влаги по стандарту IP67. По вопросам гарантийного обслуживания необходимо обращаться в магазины МТС (АО РТК). Наличие сервисной поддержки Samsung в РФ.",
      },
    ],
  },
  {
    id: "5",
    text: "Планшеты",
    imageSrc: "/img/tablet.jpg",
    items: [
      {
        id: "13",
        imageSrc: "/img/tabsamsung.jpg",
        text: "Samsung",
        price: 31000,
        description:
          "Планшет Samsung Galaxy Tab A9+ 5G Graphite (SM-X216B) обладает экраном диагональю 11 дюймов разрешением 1200x1920 пикселей. Отображается 16 млн цветов. Частота обновления составляет 60 Гц, что обеспечивает плавность прокрутки страниц.  основе модели лежит восьмиядерный процессор Qualcomm Snapdragon 695 5G, частота которого достигает 2,2 ГГц. В сочетании с 8 Гб оперативной памяти он гарантирует стабильную работу. Объем хранилища данных — 128 Гб, при необходимости его можно увеличить за счет карты microSD (до 1024 Гб).Встроены модули Wi-Fi и Bluetooth для выхода в интернет и обмена файлами с совместимыми устройствами. Поддерживается технология Wi-Fi Direct. Четыре динамика воспроизводят громкий звук, микрофоны отвечают за точную передачу речи при общении, в том числе по видеосвязи — для этого предусмотрена фронтальная камера разрешением 5 Мп. Можно подключить проводные наушники через 3,5-миллиметровый разъем. Тыловая камера на 8 Мп способна снимать качественные фотографии и видеоролики.",
      },
      {
        id: "14",
        imageSrc: "/img/tabhuawei.jpg",
        text: "Huawei",
        price: 22000,
        description:
          "Планшет Huawei MatePad космический серый (год презентации — 2023) с диагональю экрана 11,5 дюйма представлен в цельнометаллическом корпусе габаритами весом 499 г и оснащен съемной клавиатурой для быстрого безошибочного ввода данных. Девайс функционирует под управлением восьмиядерного процессора Snapdragon 7 Gen 1 частотой 2,4 ГГц и видеопроцессора Adreno 644. Размер оперативной памяти — 8 Гб, встроенной — 128 Гб. Беспроводные адаптеры Wi-Fi 4, 5, 6 (двухдиапазонный) и Bluetooth 5.2 расширяют коммуникационные возможности устройства. Операционная система Harmony OS 3.1 отличается повышенным быстродействием благодаря интеллектуальной опции важности выполнения задач.",
      },
      {
        id: "15",
        imageSrc: "/img/tablenovo.jpg",
        text: "Lenovo",
        price: 18000,
        description:
          "Работает планшет на базе восьмиядерного центрального процессора Qualcomm Snapdragon 685 с тактовой частотой 2,8 ГГц, который обеспечивает оптимальный уровень быстродействия при различных сценариях использования. Интегрированный графический микроконтроллер Qualcomm Adreno 610 и 8 Гб оперативной памяти также повышают скорость обработки системных команд и запросов пользователя при загрузке операционной системы Android 13 с системным интерфейсом ZUI 15.",
      },
    ],
  },
  {
    id: "6",
    text: "SSD",
    imageSrc: "/img/ssd.jpg",
    items: [
      {
        id: "16",
        imageSrc: "/img/ssdsamsung.jpg",
        text: "Samsung",
        price: 5500,
        description:
          "Жесткий диск SSD Samsung 870 Evo выполнен в форм-факторе 2,5”. Он подходит для стационарных компьютеров и ноутбуков с интерфейсом SATA III, использующихся для игр, создания контента и обработки больших объемов информации. Корпус твердотельного накопителя изготовлен из ABS-пластика. В нем размещается флеш-память типа 3D TLC NAND. Модель совместима с устройствами с Windows 7, 8 и 10. В режиме чтения максимальная скорость передачи данных составляет 560 МБ/с, при записи — 530 МБ/с.",
      },
      {
        id: "17",
        imageSrc: "/img/ssdadata.jpg",
        text: "Adata",
        price: 5300,
        description:
          "Современные модели SSD с типом памяти 3D обеспечивает плотность хранения, открывая возможности для работы с большими объемами данных и повышая производительность. С вместимостью 1 ТБ вы сможете хранить все важные файлы, мультимедию и игры, наслаждаясь высокой производительностью и мгновенной загрузкой даже тяжелых приложений.Интерфейс SATA III обеспечивает отличную скорость передачи данных и совместимость с большинством современных систем.",
      },
      {
        id: "18",
        imageSrc: "/img/ssdcrucial.jpg",
        text: "Crucial",
        price: 4700,
        description:
          "SATA накопитель Crucial BX500 - быстрое и надежное устройство хранения, которое обеспечивает высокий уровень производительности обработки ресурсов разной сложности. Он представлен в востребованном форм-факторе 2.5 дюйма и оснащен интерфейсом подключения SATA.Устройство Crucial BX500 отличается совместимостью с ноутбуками, стационарными ПК и другими вычислительными платформами.Объем 500 ГБ гарантирует размещение большого количества документов, мультимедийных файлов, игр.",
      },
    ],
  },
  {
    id: "7",
    text: "USB",
    imageSrc: "/img/usb.jpg",
    items: [
      {
        id: "19",
        imageSrc: "/img/usbsandisk.jpg",
        text: "SanDisk",
        price: 1500,
        description:
          "Высокая Скорость и Стиль: USB-флеш-накопитель SanDisk Ultra Flair USB 3.0 гарантирует быструю передачу файлов. Экономьте время — отдайте предпочтение высокой скорости USB 3.0, которая достигает 150 МБ/с. Надежный и изящный металлический корпус накопителя выдерживает сильные удары. Защита паролем обеспечит конфиденциальность ваших личных файлов. Храните файлы на стильном USB-флеш-накопителе SanDisk Ultra Flair USB 3.0.",
      },
      {
        id: "20",
        imageSrc: "/img/usbkingston.jpg",
        text: "Kingston",
        price: 1170,
        description:
          "Флешка USB Kingston DataTraveler Kyson - стильный и надежный накопитель.Устройство DataTraveler® Kyson™ корпорации Kingston — высокопроизводительный флеш-накопитель USB типа А. Металлическая конструкция без колпачка избавит Вас от неприятностей из-за потери колпачка, а функциональное кольцо облегчает взятие устройства с собой куда угодно.Флешка USB Kingston DataTraveler Kyson предлагает надежное и быстрое решение для хранения и переноса больших объемов данных. С USB-накопителем емкостью 64 Гб, Вы можете хранить фотографии, видео, музыку, другой контент и обмениваться ими прямо на ходу.",
      },
      {
        id: "21",
        imageSrc: "/img/usbtranscend.jpg",
        text: "Transcend",
        price: 1600,
        description:
          "Флешка USB 3.0 Transcend JetFlash 790 (TS128GJF790K) - это компактное, портативное и удобное устройство для хранения и передачи цифровой информации. С его помощью можно легко переносить и хранить документы, фотографии, видео, музыку и многое другое.Флешка оснащена легко подключаемым интерфейсом USB 3.0, который обеспечивает быструю и простую передачу данных. Благодаря этому, вы сможете быстро и легко подключить ее к компьютеру или другому устройству с поддержкой USB.Флешка имеет объем памяти 128 ГБ, что позволяет хранить большое количество информации.Transcend JetFlash 790 имеет выдвижной разъем, который обеспечивает удобство использования и позволяет легко подключать флешку к различным устройствам.",
      },
    ],
  },
];

export const items = {};
products.forEach((product) => {
  if (product.items) {
    product.items.forEach((item) => {
      items[item.id] = item;
    });
  }
});
